starter/channel_newtonian/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0   0          0)
    (0.1 0          0)
    (0.1 1.0  0)
    (0   1.0  0)
    (0   0          0.01)
    (0.1 0          0.01)
    (0.1 1.0  0.01)
    (0   1.0  0.01)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (4 100 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces ( (0 4 7 3) );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces ( (1 5 6 2) );
    }
    topWall
    {
        type wall;
        faces ( (3 7 6 2) );
    }
    bottomWall
    {
        type wall;
        faces ( (0 1 5 4) );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
