starter/channel_newtonian/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

libs            ("libSiskoGeneralisedNewtonian.so");
application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         50000;
deltaT          1;

writeControl    timeStep;
writeInterval   500;
purgeWrite      0;

writeFormat     ascii;
writePrecision  10;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;
